export default {
  // 账号名（必须是大小写字母或数字，长度在3-16之间）
  account: val => /^[a-zA-Z0-9_-]{8,20}$/.test(val),
  // 密码（必须同时包含数字和字母，长度在6-16之间）
  password: val => /^(?=.*\d)(?=.*[A-Za-z])(\w).{6,16}$/.test(val),
  // 手机号
  phone: val => /^((13[0-9])|(14[5|7|9])|(15([0-3]|[5-9]))|(16([6]))|(17([1-3]|5|6|7|8]))|(18([0-9]))|(19([8-9])))\d{8}$/.test(val) ,
  //身份证号吗
  idCard: val => /^(\d{6})(\d{4})(\d{2})(\d{2})(\d{3})([0-9]|X)$/.test(val) ,
  //银行卡号
  bankCard: val => /^([1-9]{1})(\d{15}|\d{16}|\d{18})$/.test(val) ,
  // 邮箱
  email: val => /^(\w-*\.*)+@(\w-?)+(\.\w{2,})+$/.test(val),
  // 机构中心编码
  orgCode: val => /^[A-Za-z]{3,10}$/.test(val),
  // 不少于1位的英文
  english: val => /^[A-Za-z \s]{1,}$/.test(val),
  // 正整数
  integer: val => /(^[1-9]\d*$)/.test(val),
  // 验证网址
  url: val => /(http|ftp|https):\/\/[\w\-_]+(\.[\w\-_]+)+([\w\-.,@?^=%&:/~+#]*[\w\-@?^=%&/~+#])?/.test(val)
}
